Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Distributed under the GNU General Public License.
ru_ru: Распространяется по лицензии GNU General Public License.

source: During 2000--2001 we searched for the optimal format of the input data, programming language, concept of interactive map editor and internal algorithms with the help of Martin Sluka (Prague) and Martin Heller (Zurich).
ru_ru: В период 2000--2001 годов мы искали оптимальный формат входных данных, язык программирования, концепцию интерактивного редактирования карт и внутренних алгоритмов с помощью Martin Sluka (Прага) и Martin Heller (Zurich).

source: E.g. for |min-symbol-scale M|, no points or lines scaled |S| and |XS| will be shown on the map.
ru_ru: Например, при опции |min-symbol-scale M| никакие точечные или линейные сим\-волы при масштабе |S| и |XS| не будут показаны на карте.

source: Each error message is highlighted and is hyperlinked to the source file where the error occurred.
ru_ru: Каждое сообщение об ошибке подсвечивается и является гиперссылкой на исходный файл, где произошла ошибка.

source: Each file may contain more scraps.
ru_ru: Каждый файл может содержать несколько скрапов.

source: Each line symbol gets the { path} in absolute coordinates as the first argument.
ru_ru: Каждый линейный символ получает { путь} в абсолютных координатах в качестве первого аргумента.

source: Each line symbol is oriented and its visualization may depend on its orientation (e.g. pitch edge ticks).
ru_ru: Каждый символ линии ориентирован, и его визуализация может зависеть от его ориентации (например, галочка на конце линии).

source: Each new symbol has to be registered by a macro call
ru_ru: Каждый новый символ должен быть зарегистрирован вызовом макроса:

source: Each of the following sections describes one Therion command using the following structure:
ru_ru: В каждом из следующих разделов описывается одна команда Therion'а,\break использующая следующую структуру:

source: Each of them may apply to line label according to its |-size| option.
ru_ru: Каждый из этих размеров может\break применяться к линейному текстовому символу в соответствии с ее опцией |-size|.

source: Each projection is identified by a type and optionally by an index in the form |type[:index]|.
ru_ru: Каждая\break проекция идентифицируется типом и дополнительно индексом в форме |тип[:индекс]|.

source: Each record has a special format
ru_ru: Каждая запись имеет специальный формат

source: Each scrap has its own local cartesian coordinate system, which usually corresponds with the millimeter paper (if you measure the coordinates of map symbols by hand) or pixels of the scanned image (if you use XTherion).
ru_ru: У каждого скрапа есть своя собственная локальная декартова система\break координат, которая обычно соответствует миллиметровой бумаге (если Вы определяете координаты символов карты вручную) или пикселям\break отсканированного изображения (если Вы используете XTherion).

source: Each survey has its own namespace specified by its |<id>| argument.
ru_ru: Каждый survey имеет собственное пространство имен, указанный его\break аргументом |<идентификатор>|.

source: Each symbol has to have a unique name, which consists of following items:
ru_ru: Каждый символ должен иметь уникальное имя, состоящее из следующих элементов:

source: Encoding has to be followed by five font specifications for regular, italic, bold, sans-serif and sans-serif oblique styles.
ru_ru: За кодировкой должны следовать пять спецификаций шрифтов для\break обычных, курсивных, полужирных, без засечек и наклонных без засечек.

source: End is default.
ru_ru: По умолчанию `end' (в конце линии).

source: Environment variables.
ru_ru: Переменные среды.

source: Especially useful are the numbers of neighbouring pages in N, S, E and W directions, as well as in upper and lower levels.
ru_ru: Особенно полезны номера соседних страниц в направлениях N, S, E и W, а также в верхнем и нижнем уровнях.

source: Even if the station 1 is present more then one time in the map, therion automatically detects correct position of this station in each scrap and they are usually drawn correctly.
ru_ru: Даже если станция 1 присутствует более одного раза на карте, Therion автоматически определяет правильное положение этой станции в каждом скрапе, и они обычно рисуются правильно.

source: Even if there are several possibilities how to map survex prefix structure to therion survey structure, the most clean solution is to create survey structure to desired depth in .th files using empty |survey|/|endsurvey| pairs and allways use |-surveys use| switch when importing .3d files.
ru_ru: Даже если есть несколько возможностей, как сопоставить структуру\break префикса карты survex со структурой съемки Therion'а, самым чистым\break решением является создание структуры в .th файлах с использованием\break пустой пары |survey|/|endurvey| и всегда использовать |-surveys use| при импорте файлов .3d.

source: Exactly the same as in the outline in the { File commands} menu.
ru_ru: Точно такой же, как в меню { Команды в файле}.

source: Examine this book, ponder the meaning we have dispersed in various places and gathered again; what we have concealed in one place we have disclosed in another, that it may be understood by your wisdom. -10pt { ---Henricus C. Agrippa ab Nettesheym, 1533} }
ru_ru: Изучите эту книгу, подумайте о том, что мы рассеяли в разных местах и собрались\break снова; что мы скрывали в одном месте, которое мы раскрыли в\break другом, что оно может быть\break понято вашей мудростью. -10pt { -- {\font\tt=fhar6a at 8px \tt Хенрикус С. Агриппа Ноттенсгеймский,} 1533} }

source: Example code:
ru_ru: Пример кода:

source: Example data.
ru_ru: Примеры данных.

source: Example how to create atlas with lists of surveyors etc.followed by map pages and with legend at the end:
ru_ru: Пример создания атласа со списками съемщиков и т.д.за которыми следуют карты и с легендой в конце:

source: Example how to use other fonts (e.g. TrueType Palatino in xl2 (an encoding derived from ISO8859-2) encoding).
ru_ru: Пример использования других шрифтов (например, TrueType Palatino в кодировке xl2, кодировка, полученная из ISO8859-2).

source: Example on how to define and use patterns:
ru_ru: Пример того, как определять и использовать шаблоны:

source: Example:
ru_ru: Пример:

source: Example: standard name for a point `water-flow' symbol with a `permanent' subtype in the `MY' set is |p_waterflow_permanent_MY|.
ru_ru: Пример: стандартное имя для символа `water-flow' с подтипом `permanent' в наборе `MY' -- |p_waterflow_permanent_MY|.

source: Example: |station 4 "pit to explore" continuation attr code "V"|
ru_ru: Пример: |station 4 "колодец для изучения" continuation attr code "V"|

source: Example: |station 40 "ugly crollway" continuation explored 100m|
ru_ru: Пример: |station 40 "ужасная прогулка" continuation explored 100m|

source: Examples of simple queries follow:
ru_ru: Примеры простых запросов:

source: Examples: |+4|, |[+4 m]|, |[fix 1510 m]|.
ru_ru: Например: |+4|, |[+4 m]|, |[fix 1510 m]|.

source: Exceptions are { section} which has no visual representation; all { labels}, which require special treatment as described in the previous chapter, and { station} which takes only one argument: position (pair).
ru_ru: Исключения\break составляют { section (сечение)}, который не имеет визуального представления; все { labels (подписи)}, которые требуют специальной обработки, как описано в предыдущей главе; и { station (станция)}, которая принимает только один аргумент: position (положение, пара).

source: Explored but unsurveyed passage lengths are also part of summary statistics.
ru_ru: Исследуемые, но не отснятые хода также являются частью сводной статистики.

source: Explored lengths are a part of survey/cave statistics, displayed separately.
ru_ru: Исследовательские длины являются частью\break статистики съемки/пещеры, отображаемой отдельно.

source: Exports selected surveys or maps.
ru_ru: Экспортирует выбранные съемки или карты.

source: Features.
ru_ru: Особенности.

source: Feb 18: start of reprogramming (Perl)
ru_ru: Февраль, 18: начало перепрограммирования (Perl).

source: Feb: Therion 0.5 --- Support for bitmap sketches morphing.
ru_ru: Февраль: Therion 0.5 -- Поддержка морфинга эскизов растровых\break изображений.

source: File questions.html then contains following list:
ru_ru: Файл questions.html содержит следующий список:

source: Finally draw cross-sections.
ru_ru: В конец рисуем поперечные сечения.

source: Finally the position of curves' control points is adjusted to preserve smoothness.
ru_ru: В конце положение контрольных точек кривых корректируется, чтобы сохранить гладкость.

source: First of all, we would like to start our extended elevation at station 6 (where the entrance is).
ru_ru: Прежде всего, мы хотели бы начать нашу разрез-развертку на станции 6 (где находится вход).

source: First one sets attributes for the whole curve, like type or name.
ru_ru: Сначала устанавливаются атрибуты для всей кривой, такие как тип или имя.

source: First run.
ru_ru: Первый запуск.

source: First, you have to decide which part of the cave (which scrap) you'll draw.It's possible to draw more than one scrap in one file, in which case all inactive scraps are rendered yellow.]
ru_ru: Во-первых, вам нужно решить, какую часть пещеры (какой скрап) вы рисуетеВ одном файле можно нарисовать несколько скрапов, в этом случае все неактивные скрапы отображаются желтым.].

source: Following coordinate systems are supported:
ru_ru: Поддерживаются следующие системы координат:

source: Following simple example illustrates basic usage of Therion commands:
ru_ru: Следующий простой пример иллюстрирует базовое использование команд Therion'а:

source: Following symbols may not be used with this option: point { section} (which isn't rendered at all) and all point and line labels ({ label}, { remark}, { altitude}, { height}, { passage-height}, { station-name}, { date}).
ru_ru: Следующие символы не могут использоваться с этой опцией: точечный { section} (который вообще не отображается) и все точечные и линейные надписи ({ label}, { remark}, { altitude}, { height}, { passage-height}, { station-name}, { date}).

source: Following symbols take additional arguments:
ru_ru: Следующие символы принимают дополнительные аргументы:

source: Following token registers may be used (according to user's requirements before or after the || macro):
ru_ru: Следующие символьные регистры могут использоваться (в соответствии с необходимостью до или после макроса ||):

source: For Windows consider using MinGW and MSYS ({http://www.mingw.org}).
ru_ru: Для Windows\break необходимы MinGW и MSYS ( {http://www.mingw.org}).

source: For better performance on slower computers, it's possible to temporarily unload a currently unused image from memory by unchecking its { Visibility} check-box.
ru_ru: Для повышения производительности на более медленных компьютерах можно временно выгрузить неиспользуемое изображение из памяти, сняв флажок { показать}.

source: For compiler features see the chapter { Processing data}.]
ru_ru: Функции компилятора смотрите в главе Обработка данных.].

source: For coordinates and alignment details, see |map-header| specification.
ru_ru: Для координат и деталей выравнивания смотрите спецификацию на |map-header|.

source: For details see chapter { Data format}.
ru_ru: Подробнее смотрите главу { Формат данных}.

source: For displaying of maps and models you may use any of the following programs:
ru_ru: Для отображения карт и моделей вы можете использовать любую из\break следующих программ:

source: For drawing and filling use |thdraw| and |thfill| commands instead of 's |draw| and |fill|.
ru_ru: Для рисования и заполнения используйте команды |thdraw| и |thfill| вместо команд \ |draw| и |fill|.

source: For each mode of operation, there is an additional right or left menu.
ru_ru: Для каждого режима работы есть дополнительное меню справа или слева.

source: For each scrap (with the exception of scraps in `none' projection) at least one station with station reference (|-name| option) has to be specified.], |section||section| is an anchor for placing the cross-section at this point.
ru_ru: Для каждого скрапа (за исключением скрапов с проекцией `none') должна быть указана хотя бы одна станция с опцией |-name|.] (станция), |section||Section| является местом для размещения поперечного сечения в этой точке.

source: For example, if you enter expression `station' and press { Show All}, all stations on the picture will become red.
ru_ru: Например, если вы введете слово\break `station' и нажмите { Показать все}, все станции на экране станут красными.

source: For example, there is a survey |main| which contains surveys |a|, |b|, |c| and |d|.
ru_ru: Например, есть survey |main| который содержит surveys |a|, |b|, |c| и |d|.

source: For font management there are macros
ru_ru: Для управления шрифтом есть следующие макросы:

source: For greatest portability use relative paths and Unix slashes `|/|', not Windows backslashes `|', as directory separators.
ru_ru: Для максимальной портабельности\break используйте относительные пути, а для разделения каталогов используйте характерный для Unix `|/|', а не обратный слеш используемый в Windows `|'.

source: For instance, survey stations names can be the same if they are in different surveys.
ru_ru: Например, имена станций съемки могут быть одинаковыми, если они находятся в разных survey.

source: For interleaved data both newline and direction keywords are supported.
ru_ru: Для разноуровневых данных поддерживаются ключевые слова новой\break строки и направления.

source: For labels, you can switch colour |on/off|.
ru_ru: Для подписей вы можете включать/выключать цвет |on/off|.

source: For legend displaying there are
ru_ru: Для отображения легенды есть макросы:

source: For line symbols, there are two control menus: { Line control} and { Line point control}.
ru_ru: Для символов линии существуют два управляющих меню: { Линия} и { Точка линии}.

source: For list of therion texts and available translations, see |thlang/texts.txt| file.
ru_ru: Список текстов и доступных переводов смотрите в файле |thlang/texts.txt|;

source: For modifying previously-created commands, there are additional menus---e.g. { Scrap control} for the |scrap| command.
ru_ru: Для изменения ранее созданных команд есть дополнительные меню --\break например { Скрап} для команды |scrap|.

source: For more details see the { Initialization} section in the { Appendix}.
ru_ru: Более\break подробную информацию смотрите в разделе { Инициализация} в { Приложении}.

source: For most of the menus and buttons, there is a short (translated) description in the status line, so it's not hard to guess the meaning of each one.
ru_ru: Для большинства меню и кнопок в строке состояния есть короткое описание, поэтому нетрудно догадаться о значении каждого из них.

source: For objects created with ``multi line'' commands is syntax following
ru_ru: Для объектов, созданных с помощью команд ``multi line'' используется\break синтаксис:

source: For pdf's extensions there is a short manual
ru_ru: Для освоения Pdf\ имеется краткое руководство

source: For really large caves it's possible to build a hierarchical structure of directories.
ru_ru: Для действительно больших пещер можно построить иерархическую\break структуру каталогов.

source: For small and simple caves, the whole cave may belong to one scrap.
ru_ru: Для небольших и простых пещер вся пещера может поместиться в одном скрапе.

source: For the final map, all drawings are transformed as specified in the { T} transformation variable, so it's necessary to set this variable before drawing.
ru_ru: Для окончательной карты все\break чертежи трансформируются, как указано в переменной трансформации { T},\break поэтому перед ее рисованием необходимо установить эту переменную.

source: For those who want to understand more about it, here is a brief explanation of the above flowchart.
ru_ru: Для тех, кто хочет больше узнать об этом, кратко изложим приведенную выше блок-схему.

source: For user's convenience, there is || token register.
ru_ru: Для удобства пользователя существует символьный регистр ||.

source: For working with Therion it is enough to know that you have to create input data (best done with XTherion), run Therion, and display output files (3D model, map, log file) in the appropriate program.
ru_ru: Для работы с Therion'ом достаточно знать, что вам нужно создавать входные данные (лучше всего делать это в XTherion'е), запускать Therion и\break отображать выходные файлы (3D-модель, карта, лог-файл) в\break соответствующей программе.

source: For |map-bg|, you can use |transparent| to omit page background completely.
ru_ru: Для |map-bg| вы можете использовать |transparent| чтобы полностью\break исключить фон страницы.

source: For |map-fg|, you can use |altitude|, |scrap| or |map| as colours.
ru_ru: Для |map-fg| вы можете использовать |altitude|, |scrap| или |map| как цвета.

source: Future.
ru_ru: Будущее.

source: General.
ru_ru: Главная.

source: Gradient lines length and orientation is an average of specified |l-size|s and |orientation|s in the nearest points.
ru_ru: Длина и ориентация уклона определяется указанными |l-size| и |orientation| (ориентация) в ближайших точках.

source: Group may be one of the following: all, centerline, sections, {5.3}water, speleothems, passage-fills, {5.4}ice, sediments, equipment.
ru_ru: Группа (group) может быть одной из следующих: all (все), centerline (нитка хода), sections (сечения), {5.3}water (вода), speleothems (спелеотемы),\break passage-fills (рельеф хода), {5.4} ice (лед), sediments (отложения), equipment\break (оборудование).

source: Hacker's guide.
ru_ru: Руководство для хакеров.

source: Hand-editing of such files is not easy---especially when you draw maps, you need to think in spatial (Cartesian coordinate) terms.
ru_ru: Ручное редактирование таких файлов непросто, особенно когда вы рисуете карты и вам нужно думать о пространственных (декартовых координатах).

source: Here is an example:
ru_ru: Вот пример:

source: Here is the list of variables defined for each page:
ru_ru: Ниже приведен список переменных, определенных для каждой страницы:

source: Here you can change the ID (very important!) and other options.
ru_ru: Здесь вы можете изменить ID (очень важно!) и другие опции.

source: History.
ru_ru: История изменений.

source: Hobby, J. D.: { A User's Manual for MetaPost}, available at {http://cm.bell-labs.com/cm/cs/cstr/162.ps.gz}
ru_ru: Hobby, J. D.: { A User's Manual for MetaPost}, доступно здесь: {http://cm.bell-labs.com/cm/cs/cstr/162.ps.gz}

source: How does it work?.
ru_ru: Как это работает?.

source: How the map is put together.
ru_ru: Как карта собирается в единое целое.

source: How to create models?.
ru_ru: Как создавать модели?.

source: How to draw maps?.
ru_ru: Как рисовать карты?.

source: How to enter centreline?.
ru_ru: Как ввести нитку хода?.

source: However, it's possible to make permanent changes to the macro files.
ru_ru: Тем не менее, возможно внесение постоянных изменений в файлы макросов.

source: However, this requires knowledge of the language, which is used for map visualization.
ru_ru: Однако для этого требуется знание языка , который используется для визуализации карты.

source: However, you need to know how to write plain and macros to do this.
ru_ru: Тем не менее, вам нужно знать, как писать простые макросы и , чтобы добиться этого.

source: Ideally, a scrap contains about 100 m of the cave.If necessary, scraps may be much smaller---just to display a few meters of the cave.
ru_ru: В идеале скрап содержит около 100 м пещерыЕсли необходимо, скрапы могут быть намного меньше, несколько метров пещеры.

source: If a data line starts with a word reserved for an option, you have to insert `|!|' in front of it.
ru_ru: Если строка данных начинается со слова, зарезервированного для опции, вам нужно вставить `|!|' перед ней.

source: If all line points have this option, they are aligned to the average $y$ or $x$ coordinate, respectively.
ru_ru: Если у всех точек линии есть этот параметр, они выравниваются посередине координаты $y$ или $x$, соответственно.

source: If backward and forward compass or clino reading are given, the average of them is computed.
ru_ru: Если есть прямые и обратные данные азимута или угла, то вычисляется среднее из них.

source: If flag is set to |approx[imate]|, it is included to total length calculations, but also displayed separately in survey statistics.
ru_ru: Если флаг установлен на |approx[imate]|, он включается в вычисления общей длины, но также отображается отдельно в статистике съемки.

source: If multiple dates are specified, a time interval is created.
ru_ru: Если указано несколько дат, создается временной интервал.

source: If multiple grades are specified, only the last one applies.
ru_ru: Если указано несколько определений, то применяется только последнее.

source: If no declination is specified and some geodetic coordinate system is defined, the declination is automatically computed using built-in geomagnetic model.
ru_ru: Если не определено склонение и определена какая-либо геодезическая система координат, склонение автоматически вычисляется с\break использованием встроенной геомагнитной модели.

source: If no declination is specified, or the declination is reset (|-|), then a valid declination specification is searched for in all surveys the data object is in.
ru_ru: Если ни одно cклонение не указано, или cклонение сброшено (|-|), тогда действительная спецификация склонения ищется во всех съемках, в которых находится объект данных.

source: If no file is found Therion uses its default settings.
ru_ru: Если файл не найден, Therion использует настройки по умолчанию.

source: If no file name is given the prefix ``|cave.|'' is used with an extension corresponding to output format.
ru_ru: Если имя файла не задано, префикс ``|cave.|'' используется с расширением, соответствующим\break выходному формату.

source: If no match is found, everything before any occurence of |<lang:ZZ>| tag is displayed.
ru_ru: Если совпадение не найдено, все до появления тега |<lang:ZZ>| отображается.

source: If no name is specified |thconfig| in the current directory is used.
ru_ru: Если имя не указано, то ищется файл |thconfig| в текущем каталоге.

source: If no stations are specified, |<spec>| is valid for following shots specified.
ru_ru: Если ни одна из станций не указана, |<spec>| действует для следующих указанных замеров.

source: If no |cs| is defined in the configuration file, the first |cs| therion encounters in the data files is used as an output |cs|.
ru_ru: Если |cs| не определяется в файле конфигурации, то будет использован\break первый |cs| в файлах данных.

source: If not specified and there is exactly one station marked entrance in this survey, it is considered to represent a cave also.
ru_ru: Если это не указано, и в этом survey есть только одна станция отмеченная входом, он считается также входом в пещеру.

source: If not specified, appropriate value from LRUD data is used.
ru_ru: Если не указано, используется соответствующее значение из данных LRUD.

source: If not specified, it will be calculated from |page-setup| and |overlap|.
ru_ru: Если не указано, то размер будет рассчитан по |page-setup| и\break |overlap|.
